Autodesk.Revit.DB.Structure.BoundaryConditions.AssociatedLoadId
The Id of the internal load element associated with a boundary conditions.
Remarks:
ElementId may be set if the internal load exists and it's type fit the BoundaryConditions type only (Point, Line and Area).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: elementId is not a valid Element identifier.
-or-
When setting this property: Throws when the ElementId does not refer to the internal load with appropriate type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016